[
  {
    "name": "Paper: On the Role of Summary Content Units in Text Summarization Evaluation",
    "technologies": ["NAACL Main Conference 2024", "NLP"],
    "description": "We conducted research on the role of summary content units in text summarization evaluation. The paper was accepted at the NAACL Main Conference 2024. The code is available on Github.",
    "text": [
      "At the heart of the Pyramid evaluation method for text summarization lie human written summary content units (SCUs). These SCUs are concise sentences that decompose a summary into small facts. Such SCUs can be used to judge the quality of a candidate summary, possibly partially automated via natural language inference (NLI) systems.",
      "Interestingly, with the aim to fully automate the Pyramid evaluation, Zhang and Bansal (2021) show that SCUs can be approximated by automatically generated semantic role triplets (STUs). However, several questions currently lack answers, in particular: i) Are there other ways of approximating SCUs that can offer advantages? ii) Under which conditions are SCUs (or their approximations) offering the most value?",
      "In this work, we examine two novel strategies to approximate SCUs: generating SCU approximations from AMR meaning representations (SMUs) and from large language models (SGUs), respectively. We find that while STUs and SMUs are competitive, the best approximation quality is achieved by SGUs. We also show through a simple sentence-decomposition baseline (SSUs) that SCUs (and their approximations) offer the most value when ranking short summaries, but may not help as much when ranking systems or longer summaries."
    ],
    "language": "en",
    "image": "./img/scu.jpg",
    "date": "2024",
    "github": "https://github.com/tristanratz/SCU-text-evaluation",
    "link": "https://arxiv.org/abs/2404.01701"
  },
  {
    "name": "ITRF: Instruction-Tuned Reranker Fine-Tuning",
    "technologies": ["LLM", "Llama", "NLP", "RAG", "Python"],
    "description": "During my Thesis I researched ways on how to effectively train rerankers to score better results in retrievel augmented generation (RAG) applications.",
    "text": [
      "Large Language Models (LLMs) have emerged as one of the most profound shifts in Natural Language Processing (NLP). While generally applicable they have their shortcomings: Generate content is often hallucinated, there is a lack of provenance and its knowledge is costly to update. Retrieval Augmented Generation (RAG) aims to relieve these issues by providing the LLM with relevant information.",
      "In this work we establish a retrieval corpus, build a RAG pipeline, fine-tune a language model on task specific data in a parameter efficient way to extract knowledge from provided contexts and subsequently train a reranker to predict the probability a document is going to help the LLM generate the right answer on 25 datasets. We establish five distinct pipelines which we evaluate on faithfulness, answer relevancy, answer semantic similarity, context recall and context relevancy. We find that a out of the box pre-trained reranker in combination with our fine-tuned model works best on a range of scores, with a third-party LLM with our reranker provides the answer most closely to the ground truth. The code and models are available open source."
    ],
    "language": "en",
    "image": "./img/thesis.jpg",
    "date": "2024",
    "github": "https://github.com/tristanratz/ITRF"
  },
  {
    "name": "diverSATy",
    "technologies": [""],
    "description": "As it turns out... Climate Change is real. It's been there for years. Daily in the news. But its slowly coming to us. To our cities and homes.",
    "text": [
      "The lack of green in cities leads to bad water drainage and heat islands. These cause climate related damages which are enormous; In dutch cities alone between 2020-2040 an estimated €33-€87 Billions!",
      "Less and less space in cities still leave one perfect spot to bring back the green: Our roofs.",
      "We came up with a service which identifies the most vulnerable and suitable points to install green roofs. With just a matter of clicks we can help green roof installers sell more roofs, insurances reduce risk and municipalities monitor subsidies as well as housing corporations to make the most difference for their buildings and inhabitants.",
      "Read what the dutch space organisation (NSO) wrote about us down below."
    ],
    "language": "en",
    "image": "./img/green_roofs.jpg",
    "date": "2022",
    "link": "https://www.spaceoffice.nl/nl/nieuws/588/studenten-tu-e-ontwikkelen-prototype-ruimtevaarttoepassing.html"
  },
  {
    "name": "Yacht.Chat: Your Virtual Office",
    "technologies": ["React", "WebRTC", "JavaScript", "CSS", "Java", "WebSockets", "Collaboration"],
    "description": "Over the course of the last year we saw the problem, that teams working remotly tend to lose their sense of team spirit. Therefore, we wanted to provide a solution.",
    "text": [
      "We present Yacht.Chat to you. Yacht.Chat is a digital communication platform that enables real-time collaboration for remotely working teams. ",
      "Unlike existing communication solutions, Yacht.Chat allows each team member to move around freely in a virtual space and adjust their speaking radius. Conversations can emerge spontaneously and adapt to team dynamics. ",
      "Yacht.Chat helps increase information exchange and lets team members feel like a team again. Yacht.Chat combines the collaborative working methods of an office with the advantages of remote work. ",
      "Try it out for free with the link below."
    ],
    "language": "en",
    "image": "./img/yachtchat.png",
    "date": "2021",
    "link": "https://www.yacht.chat"
  },
  {
    "name": "Interactive Image Segmentation",
    "technologies": ["Python", "Tensorflow", "Label Studio", "Computer Vision", "Image Segmentation", "Machine Learning", "Bachelor Thesis"],
    "description": "In 2021 I wrote a machine learning tool, that provided the user with image segmentation proposals to accelerate the labeling process. The tool was subject of my bachelor thesis.",
    "text": ["High quality annotated data has become an increasingly important factor for successful data science and deep learning projects. However, a major issue is that the creation, preprocessing, and labeling of training data can get very expensive, hence a research field called interactive labeling has been built around that topic.",
      "Interactive labeling aims at facilitating the labeling process considerably and at making machine learning accessible for people unfamiliar with the matter. While much research has already been conducted in this field, not much of that work has been published open-source. In my bachelor thesis, I present an open-source software extension to Label Studio, an open-source multi-domain labeling tool. This extension will enable Label Studio with interactive learning capabilities in order to make labeling more feasible, less cost-intensive, and deep learning more accessible.",
      "The user first has to label a small set of images manually and is then provided with labeling predictions, which the user can refine or reject. With increasing amount of labeled images the accuracy should rise, and the user will be able to obtain a working machine learning model that successfully pre-labels the data.",
      "In my tests with the extension added to Label Studio, I was able to achieve an acceleration of labeling time up to 142.1% on average over manual labeling with a precision of 99.3% and a recall of 65.9%.",
      "In summary, I successfully developed an open-source, instance segmentation, interactive labeling extension for Label Studio that decreases labeling time and provides the user with a working Mask R-CNN model.",
      "The source code is available on GitHub."],
    "language": "en",
    "image": "./img/imagesegmentation.jpg",
    "date": "2021",
    "github": "https://github.com/tristanratz/Interactive-Image-Segmentation"
  },
  {
    "name": "Podcast",
    "technologies": ["Object Detection", "NLP", "Deep Learning", "Banking"],
    "description": "You can hear me in a podcast!",
    "text": ["In a world of changing customer expectations it is even more important to make products and workflows simpler and easier to use.",
      "This is what we tried to do with 'Fotofinanzierung'. Fotofinanzierung is a Service where you can scan a price tag and get an immediate financing offer from your bank.",
      "I will tell you about the technologies we have used, our view on privacy and more in our podcast.",
      "The podcast is available on german on all major platforms, including Apple Podcast, Google Podcast and Spotify."],
    "language": "en",
    "image": "./img/podcast.jpg",
    "date": "2020",
    "link": "https://anchor.fm/kixperts/episodes/04-KI-Fotofinanzierung-mit-Tobias--Stephan-und-Tristan-eipguk/a-a32frr8"
  },
  {
    "name": "Homepage",
    "technologies": ["React", "JavaScript", "HTML", "SCSS", "AWS"],
    "description": "This website was created using modern web technologies. The source code is available at Github.",
    "text": ["To represent me and my work, I decided to built my own website, while expanding my React and JavaScript skills even further. The different components were built on basis of React and the source code is hosted on Github to let other users find inspiration for their own work.",
      "During the process of hosting the site I gained my first experiences with Amazon Web Services and set up my Lightsail instance with Nginx, a MailServer and Weblog Analytics.",
      "This project gave me a strong basis to work on further web projects."],
    "language": "en",
    "image": "./img/website.jpg",
    "date": "2020",
    "github": "https://github.com/tristanratz/React-Template"
  },
  {
    "name": "Question Answering System",
    "technologies": ["Python", "Tensorflow", "BERT", "NLP", "NLTK", "Machine Learning"],
    "description": "In 2019 I was head of development of a Question Answering Project during a cooperation between TU Darmstadt and Serviceware SE.",
    "text": ["Question Answering is a common task in natural language processing („NLP“) – a subfield of machine learning – in which the system processes a question and retrieves a short answer for the user.",
      "Despite being common it is far from being solved. The idea is that the user does not need to search for his answer in a long text or catalogue of articles („dataset“), as he would with a normal search engine, but rather receives a preferably short answer to his question.",
      "During the project we had to explore NLP, Tensorflow, NLTK and other technologies to build a working solution. As a result we were able to generate answers to questions on a given database in multiple languages.",
      "Our system was working more accurate and even faster than existing solutions (like cdQA by PNB Paribas)."],
    "language": "en",
    "image": "./img/qa.jpg",
    "date": "2019",
    "link": "https://medium.com/@tristanratz/building-a-question-answering-system-bb49c320140c"
  },
  {
    "name": "ChatApp",
    "technologies": ["Swift", "iOS", "SwiftUI", "Project Catalyst", "Python", "Twisted"],
    "description": "To learn more about sockets and the newly released SwiftUI API I built a simple ChatApp. The source code is available at Github.",
    "text": ["After watching Apples WWDC I was especially excited about the simplicity of the newly released SwiftUI API. So I decided to create a simple ChatApp for iOS, iPadOS and macOS, which was able to communicate with a Python Server using Sockets.",
      "To see the project page on Github click on the link down below."
    ],
    "language": "en",
    "image": "./img/chatapp.jpg",
    "date": "2019",
    "github": "https://github.com/tristanratz/chatapp"
  },
  {
    "name": "Website",
    "technologies": ["PHP", "HTML", "CSS", "MySQL", "Python", "Twisted"],
    "description": "Besides creating a website with my own CMS, I also created a corporate identity for a medical private practice.",
    "text": ["The website (link below) was build on top of my previous project (CMS) and operates with it until today. I also created the corporate design for flyers, business cards and signs in the building."],
    "language": "en",
    "image": "./img/ugg.jpg",
    "date": "2016",
    "link": "http://uro-gross-gerau.de/"
  },
  {
    "name": "Content Management System",
    "technologies": ["PHP", "JavaScript", "MySQL", "HTML", "CSS"],
    "description": "A content management system, build using PHP, MySQL, HTML and JavaScript. Until today it is still in use.",
    "text": ["During my time at school I wanted to build my own content management system. Not only because I disliked existing solutions and found them to difficult to use, but also to gain experience in some web technologies. I gained experience in PHP, HTML and CSS and build my first object oriented JavaScript-Image Picker using the javaScript function prototype pattern.",
    "The CMS was graded with the best grade in the german system."
    ],
    "language": "en",
    "image": "./img/bll.jpeg",
    "date": "2015"
  },
  {
    "name": "Website",
    "technologies": ["PHP", "JavaScript", "MySQL", "HTML", "Wordpress"],
    "description": "A website for a medical office build with Wordpress.",
    "text": ["It was the first project I created using wordpress. I implemented my own wordpress theme and setup the website using wordpress. You can look at the resulting website at the link down below."],
    "language": "en",
    "image": "./img/code.png",
    "date": "2014",
    "link": "http://uro-reinheim.de/"
  }
]
